Extra_tutorials/of1906_oversetInterFoam_fallingObject/fallingObject/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboverset.so");

application     overInterDyMFoam ;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.05;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1.5;
maxAlphaCo      0.5;
maxDeltaT       1;

functions
{
    line
    {
        type            sets;
        libs            ("libsampling.so");
        enabled         true;
        writeControl    writeTime;

        interpolationScheme cellPoint;
        setFormat       raw;

        sets
        (
            s1 //xs1=x0+0.96
            {
                type            uniform;
                axis            distance;
                start           ( 1.46 0.0 0.0 );// 
                end             ( 1.46 1.0 0.0 );
                nPoints         301;
            }

            s2 //xs2=x0+0.96+0.43
            {
                type            uniform;
                axis            distance;
                start           ( 1.89 0.0 0.0 );
                end             ( 1.89 0.1 0.0 );
                nPoints         301;
            }

            s3 //xs2=x0+0.96+0.43+0.33
            {
                type            uniform;
                axis            distance;
                start           ( 2.22 0.0 0.0 );
                end             ( 2.22 1.0 0.0 );
                nPoints         301;
            }
        );

        fixedLocations  false;

        fields          (alpha.water);
    }
}

// ************************************************************************* //
